***Load a CSV file into a Pandas DataFrame and display the first 5 rows***

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('/content/sample_data/Employe_Performance_dataset.csv')
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
3                  2.0          13  Inactive  Los Angeles  Evening
4                  5.0          16  Inactive     New York  Evening
..                 ...         ...       ...          ...      ...
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening
999                2.0           4    Active     New York  Morning

[1000 rows x 12 columns]

In [ ]:
d=df.head(5)
print(d)

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening

***Select the 'Name' and 'Age' columns from a DataFrame named df***

In [ ]:
a=df.loc[:,["Name","Age"]]
print(a)

                   Name  Age
0          Cory Escobar   48
1       Timothy Sanchez   25
2          Chad Nichols   57
3    Christine Williams   58
4          Amber Harris   35
..                  ...  ...
995       Pamela Reeves   49
996        Todd Johnson   29
997     Michael Sanchez   18
998       Ashley Taylor   51
999         Shawn Scott   45

[1000 rows x 2 columns]

 ***Group a DataFrame by the 'Department' column and calculate the
average salary in each department***

In [ ]:
avg_salary = df.groupby('Department')['Salary'].mean()

print(avg_salary)

Department
HR       5982.396285
IT       5968.371681
Sales    5804.088757
Name: Salary, dtype: float64

***Sort a DataFrame by the 'Date' column in ascending order. (Take
the dataset accordingly)***

In [ ]:
b=df.sort_values(by='Joining Date')
print(b.head(10))

      ID            Name  Age  Gender Department  Salary Joining Date  \
716  717    Jeff Johnson   20   Other         IT    7345   2014-12-11
382  383    Kelly Norton   30  Female         IT    7241   2014-12-18
43    44   Cindy Nichols   64  Female         IT    2427   2014-12-19
185  186    Jane Gardner   51   Other      Sales    7894   2014-12-29
312  313    Sean Barrett   26  Female      Sales    3495   2015-01-03
86    87    Dustin Allen   34    Male         IT    8629   2015-01-08
841  842     Tammy Smith   30  Female      Sales    2087   2015-01-09
912  913  Courtney Lopez   59  Female      Sales    4875   2015-01-18
479  480       Jay Scott   28   Other         HR    5496   2015-01-21
10    11     Nicole Bell   42  Female      Sales    5336   2015-01-28

     Performance Score  Experience    Status     Location  Session
716                NaN          11  Inactive     New York  Morning
382                4.0           1  Inactive     New York  Morning
43                 NaN           6    Active     New York    Night
185                NaN          11  Inactive  Los Angeles    Night
312                1.0          18    Active  Los Angeles    Night
86                 NaN           9  Inactive      Chicago  Morning
841                5.0           6  Inactive  Los Angeles  Morning
912                NaN           6    Active  Los Angeles  Evening
479                NaN          18    Active      Chicago    Night
10                 3.0           7    Active  Los Angeles  Evening

***Add one new New column with into a existing DataFrame .***

In [ ]:
data = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 60000, 65000, 55000, 70000]
})

In [ ]:
data['Experience'] = [2,4,5,3,10]

print(data)

  Employee Department  Salary  Experience
0    Alice         HR   50000           2
1      Bob         IT   60000           4
2  Charlie         IT   65000           5
3    David         HR   55000           3
4      Eve    Finance   70000          10

**Difference between iloc and loc function , explain with example.**

***Loc***

* It is use for label base indexing
* Use loc when youre accessing by labels like row names or column names
* Syntax
df.loc[row_label, column_label]

In [ ]:
eg1=data.loc[:,["Employee","Salary"]]
print(eg1)

  Employee  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   65000
3    David   55000
4      Eve   70000

***iloc***

* it is use Integer position based indexing
* Slicing with index numbers only
* Syntax df.iloc[row_index, column_index]

In [ ]:
eg2=data.iloc[:,[0,2]]
print(eg2)

  Employee  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   65000
3    David   55000
4      Eve   70000